#!/bin/bash
echo "************ Задание 1 *********************"
echo "Дано целое четырехзначное число. Найти сумму его цифр."
number=1274
dig1=$(($number/1000))
dig2=$(($number/100%10))
dig3=$(($number%100/10))
dig4=$(($number%10))
((sum=$dig1+$dig2+$dig3+$dig4))
echo "sum=$sum"
echo "************ Задание 2 *********************"
echo "Определить длину окружности, площадь круга и объем шара для заданного радиуса."
r=4
H=6
pi=3.14
echo "length=$(bc<<<"scale=2;2*$pi*$r")"
echo "square=$(bc<<<"scale=2;$r*$pi*$r")"
echo "volume=$(bc<<<"scale=2;$r*$pi*$r*$r*4/3")"
echo "************ Задание 3 *********************"
echo "Задана площадь квадрата. Определить радиус описанной окружности."
S=36
echo "radius=$(bc<<<"scale=2;sqrt($S)/sqrt(2)")"